import { useState } from "react"

const StateExample = () => {
  //стейт (внутрішній стан компоненту) - сукупність данних які зберігаються всередині компонента

  //1) зберігати данні
  //2) викликати рендер коли ці данні змінилися

  // рендер(відмальовка) - це процесс візуалізації компонентів(html тегів) на екрані браузера

  // нам потрібен спеціальна функція (хук, hook - гачок або крюк)

  const [color, setColor] = useState("червоний") //початкове значення стейту або initial value
  //    НЕМОЖНА ЗМІНЮВАТИ СТЕЙТ НАПРЯМУ
  //    НЕМОЖНА ВИКЛИКАТИ ФУНКЦІЮ СТЕЙТУ В СЕРЕДИНІ КОМПОНЕНТУ (це призводить до безкінечного рендеру)

  return (
    <div>
      <span>{color}</span>
      <button
        onClick={function () {
          if (color === "червоний") {
            setColor("зелений")
          } else if (color === "зелений") {
            setColor("жовтий")
          } else setColor("червоний")
        }}
      >
        Змінити колір
      </button>
    </div>
  )
}

export default StateExample
